{
    "companyName":"XYZ Company",
    "background":"Company’s current business activities exposes it to exchange rate fluctuations on its foreign currency payments, receipts (including dividends from its foreign subsidiaries). The impact of these fluctuations on the Company’s profitability and financial statement can be material. It is therefore, important that the Company manages and mitigates its risk and accordingly develop a Currency Risk Management Policy Document which will provide the necessary guidelines to manage this risk.",
    "objectives":"The Company will identify, assess, monitor, and manage the foreign exchange in its business in consistent with its overall objectives.  This will be done to reduce cash flow uncertainties, and improve financial decision making.\n\nIn particular, the Company will minimize the impact of foreign exchange fluctuations on its committed and highly forecastable receipts, dividends, and payments, in foreign currencies while minimizing the cost of such protection.",
    "hedgingGuidelines":"The company will only use Permitted Hedging Instruments to mitigate foreign exchange risk in its business. Hedging instruments will only be used for hedging underlying identified foreign exchange risk, and will never be used speculatively and/or for trading purposes.\n\nAny foreign currency transactions using Permitted Hedging Instruments shall be recorded in accordance with the accounting policies followed by the Company.\n\nThe Company shall never over hedge (>100%) on an overall basis. The overall hedge ratio for its identified and hedged foreign exchange can be decided from time to time based on its risk tolerance, volatility in currency markets, cost of hedging and any relevant internal or external factors including competition behavior, macro-economic environment.\n\nThe tenor of the hedging transactions shall be decided considering the tenor of the underlying foreign currency risk and will not exceed 2 years for firm and highly forecastable payments, receipts.  For foreign currency loan hedging, the hedging transaction would not exceed the tenor of the loan.",
    "permittedHedgingInstruments":"The Company is permitted to use FX Forwards, Non-Deliverable Forwards, Vanilla FX Options, FX Swaps and Foreign Exchange Collars to manage its foreign exchange risk. The Company cannot take a net Options sale position when using FX Options. Cross Currency Swap can be used to hedge foreign currency borrowings.",
    "authorityUnderPolicy":"Day-to-day decisions regarding foreign exchange within this Policy for hedging, hedge restructuring or hedge unwinding will be made and executed by a designated dealer (or its nominee) with the approval of Treasury Manager (or its designated nominee). In absence of Treasury Manager, Finance Director (or its designated nominee) would approve above transactions. In absence of Finance Director, the above transactions would need to be approved by the CFO (or its designated nominee).",
    "segregationOfDuties":"Designated person or persons of treasury operations will maintain a detailed database of all hedges and hedged items and independently monitor the positions executed by the dealers. They will also ensure that hedges are executed in line with this FX Policy.",
    "reporting":"The details of all open exposures, foreign currency hedges, hedged items, hedge ration, details of hedging program undertaken, and performances of hedges in comparison to both budget (if any), and updated market valuations of hedges, gains and losses from hedges that were terminated early or de-designated,  will be reported from time to time (but at least quarterly) to Finance Director, CFO, and other relevant Management.\n\nPeriodical audit of the foreign exchange hedging transactions would be done by the internal auditors of the Company and reported to the Management. This will allow management to check that procedures are being followed according to the established rules and limits, so any errors can be detected on time to reduce the risk of undue or inappropriate trading activities.",
    "review":"This FX Policy will be reviewed every two years (or earlier if deemed necessary) to assess its effectiveness and if any changes are made, they would need to be approved by the CFO and CEO of the Company and if deemed appropriate, presented to the Board of Directors for approval.",
    "customized":"",
    "exceptionManagement":"All exceptions to this Policy will need to be approved by the CFO, and CEO of the Company.",
    "approval":"This FX Policy has been proposed by the Treasury Manager (or Finance Director), seconded by the CFO, and approved by the CEO (or the Board of Directors if deemed appropriate).",
    "approvalDate":null,
    "signedBy":"",
    "approvedByName":"",
    "approvedByDesignation":"",
    "name2":"",
    "designation2":"",
    "name3":"",
    "designation3":""
}
