{
    "riskManagementObjective":"This Transaction is consistent with our FX Policy Dated MMDDYYYY Or Proposed hedge is consistent with our firm’s risk management strategy as it lock-ins the exchange risk on a future payment (or receivable). This reduces the volatility of our cash-flow.",
    "typeOfHeding":"",
    "dateOfDesignation":null,
    "natureofRisk":"1",
    "identificationOfHedgeItem":"",
    "identificationOfHedgeItemSelected1":"As an example, a layer hedging may involve hedging a previously unhedged exposure by doing a FX Forward for buying or selling a certain currency midway in the financial year",
    "identificationOfHedgeItemSelected2":"As an example, Foreign exchange risk on a 12-month contract can be partially hedged for first 6 months. This risk component can be separately identified and hedged.",
    "identificationOfHedgeItemSelected3":"A hedged item can be a single item or a group of items, in its entirety or a component thereof. For example, there may be two purchase contracts to be paid on the same day for which foreign currency exposure is being hedged through a single Forward contract.",
    "isForecastedTransaction":"",
    "natureOfForecastedDesignation":"A purchase order to be paid in 6month time",
    "rationale":"6month time",
    "timeScale":"The order has been placed",
    "dealId":"YHU675J",
    "designationOfForwardElement":"",
    "foreignCurrency":"",
    "timeValue":"",
    "proportionOfHedging":"",
    "hedgeEffectiveness":"Hedge is effective due to Economic relationship between hedged item and hedge instrument. Due to this, both items will typically move in opposite directions in response to movements in the exchange risk.\n\nIf required, specify any other qualitative or quantitative analysis that may have been performed to establish economic relationship.",
    "creditRisk":"If required, specify any qualitative or quantitative analysis that may have been performed to establish that credit risk does not dominate the value changes of hedging instrument which was used to hedge an underlying.",
    "expectedCausesOfHedgePlaceHolder":"Specify what can cause hedge ineffectiveness, if any",
    "expectedCausesOfHedge":"",
    "anyOtherInfo":"",
    "proportionOfHedgingValue":""
}